<?php
if (!defined('DS')) {
    /**
     * DS - скорочений варіант DIRECTORY_SEPARATOR (стандартний роздільник каталогів для поточної операційної системи).
     *
     * Використовувати при побудові шляхів до файлу для забезпечення функціонування коду на різних ОС.
     *
     * ВАЖЛИВО! Щоб встановити власне значення для цієї константи - потрібно визначити її ДО підключення файлу vendor/autoload.php що містить автозавантажувач від Composer.
     */
    define('DS', DIRECTORY_SEPARATOR);
}

if (!defined('NESTING_SEPARATOR')) {
    /**
     * NESTING_SEPARATOR - роздільник вкладеності, що використовується при побудові шляхів без використання стандартного роздільника каталогів,
     * а також для масивів та інших структур.
     *
     * Рекомендується використовувати знак більше '>' або крапку '.' як в інших фреймворках.
     *
     * ВАЖЛИВО! Щоб встановити власне значення для цієї константи - потрібно визначити її ДО підключення файлу vendor/autoload.php що містить автозавантажувач від Composer.
     */
    define('NESTING_SEPARATOR', '>');
}

/** NS - скорочений варіант NESTING_SEPARATOR (роздільник вкладеності) */
define('NS', NESTING_SEPARATOR);

if (!defined('BACKWARD_NESTING_SEPARATOR')) {
    /**
     * BACKWARD_NESTING_SEPARATOR - роздільник вкладеності (для зворотного порядку - тобто для підйому на попередній/батьківський рівень),
     * що використовується при побудові шляхів без використання стандартного роздільника каталогів, а також для масивів та інших структур.
     *
     * Рекомендується використовувати знак більше '<'.
     *
     * ВАЖЛИВО! Щоб встановити власне значення для цієї константи - потрібно визначити її ДО підключення файлу vendor/autoload.php що містить автозавантажувач від Composer.
     */
    define('BACKWARD_NESTING_SEPARATOR', '<');
}

/** NS - скорочений варіант BACKWARD_NESTING_SEPARATOR (роздільник вкладеності для зворотного порядку - тобто для підйому на попередній/батьківський рівень) */
define('BNS', BACKWARD_NESTING_SEPARATOR);